#include <iostream>
#include <list>
#include <string>

#include <vector>


using namespace std;
struct предмет {
    string назва = "";
    int ціна = 0;
    int вага = 0;
};

void sort (vector <предмет> & set) {
  for (int i = 0; i!=set.size(); i++) {
    for (int j = i+1; j!=set.size(); j++) {
      if (set[i].ціна < set[j].ціна) {
        swap(set[i], set[j]);
      } 
    }
  }
}

int main() {

    предмет a = { "ноутбук", 25000, 3 };
    предмет b = { "ліхтар", 1500, 1 };
    предмет c = { "гіря", 750, 10 };
    предмет d = { "сокира", 1250, 4 };
    предмет e = { "пляшка води", 15, 2 };
    предмет f = { "набір туристичних інструментів", 4350, 12 };
    предмет g = { "палатка", 3000, 7 };
    предмет h = { "газовий пальник", 3250, 4 };
    предмет i = { "набір туристичного посуду", 2655, 6 };
    предмет j = { "льодоруб", 5000, 2 };

    vector <предмет> загальний_набір = { a, b, c, d, e, f, g, h, i, j };
    vector <предмет> масив_наборів;

    string m = "";
    int вага_одного_набору = 0;
    int ціна_одного_набору = 0;

    for (int i = 0; i < загальний_набір.size(); i++) {
        cout << загальний_набір[i].назва << ": " << загальний_набір[i].ціна << " грн, " << загальний_набір[i].вага << " кг" << endl;
    }
int k = 0;
    for (int i = 0; i<загальний_набір.size(); i++) {
        for ( k = i; вага_одного_набору <= 50; k++) {
            
            m = m + загальний_набір[k].назва + "|";
            вага_одного_набору = вага_одного_набору + загальний_набір[k].вага;
            ціна_одного_набору = ціна_одного_набору + загальний_набір[k].ціна;
            if (k == загальний_набір.size()-1) {
              k = -1;
            } 
            if (вага_одного_набору+загальний_набір[k+1].вага > 50) {
              
              if (k++ == загальний_набір.size()-1) {
              k = -1;
              } else {
                break;
                }
            } 
            
          
        }
        предмет тимчасова = { m, ціна_одного_набору, вага_одного_набору };
        масив_наборів.push_back(тимчасова);
        m = "";
        вага_одного_набору = 0;
        ціна_одного_набору = 0;
        
    }
  
    cout << endl;
  sort(масив_наборів);
  cout<<"Ось що треба покласти в наплічник:"<<endl;
  cout<<масив_наборів[0].назва<<endl<<масив_наборів[0].ціна<<" грн, "<<масив_наборів[0].вага<<" кг"<<endl;

  





}